; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v11 ?v8)
             (pred_8 ?v13 ?v10)
             (pred_6 ?v11 ?v10)
             (pred_5 ?v5 ?v11 )
	     (pred_7 ?v11)
             (pred_9 ?v12)
             (pred_1 ?v13)
             (pred_12 ?v10)
             (pred_3 ?v11)
             (pred_2 ?v13)
             (pred_11 ?v11)
             (pred_10 ))



(:action op_1
:parameters (?v9 ?v3 ?v7 ?v6)
:precondition (and (pred_9 ?v9) (pred_9 ?v3) (pred_1 ?v7) (pred_12 ?v6)
          (pred_4 ?v9 ?v3) (pred_8 ?v7 ?v6)
                   (pred_6 ?v3 ?v6) (pred_7 ?v9) 
                   (pred_3 ?v3) (pred_2 ?v7))
:effect (and  (pred_11 ?v3) (not (pred_3 ?v3))))


(:action op_4
:parameters (?v9 ?v2)
:precondition (and (pred_9 ?v9) (pred_9 ?v2)
               (pred_7 ?v9) (pred_4 ?v9 ?v2) (pred_11 ?v2))
:effect (and (pred_7 ?v2) (not (pred_7 ?v9))))

(:action op_2
:parameters (?v9 ?v7)
:precondition (and (pred_9 ?v9) (pred_1 ?v7) 
                  (pred_7 ?v9) (pred_5 ?v7 ?v9) (pred_10 ))
:effect (and (pred_2 ?v7)
   (not (pred_5 ?v7 ?v9)) (not (pred_10 ))))


(:action op_5
:parameters (?v9 ?v1 ?v4)
:precondition (and (pred_9 ?v9) (pred_1 ?v1) (pred_1 ?v4)
                  (pred_7 ?v9) (pred_2 ?v4) (pred_5 ?v1 ?v9))
:effect (and (pred_2 ?v1) (pred_5 ?v4 ?v9)
        (not (pred_2 ?v4)) (not (pred_5 ?v1 ?v9))))

(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_9 ?v9) (pred_1 ?v7) 
                  (pred_7 ?v9) (pred_2 ?v7))
:effect (and (pred_10 ) (pred_5 ?v7 ?v9) (not (pred_2 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_20 obj_21 obj_11 obj_07 obj_13 obj_05 obj_02 obj_19 obj_01 obj_06 obj_17 obj_03 obj_16 obj_18
    obj_12 obj_09
    obj_15 obj_04 obj_14
    )

    (:init
       (pred_10)

       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_21)
       (pred_9 obj_11)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_16)
       (pred_9 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_04)
       (pred_1 obj_14)

       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_08 obj_07)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_21)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_21 obj_20)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_07 obj_19)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_08)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_19 obj_03)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_03 obj_17)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_16)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_6  obj_19 obj_12)
       (pred_6  obj_13 obj_09)
       (pred_6  obj_02 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_08)
       (pred_11 obj_20)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_06)
       (pred_11 obj_17)
       (pred_11 obj_03)
       (pred_11 obj_16)
       (pred_11 obj_18)

       (pred_8  obj_15 obj_12)
       (pred_8  obj_04 obj_09)
       (pred_8  obj_14 obj_09)
       (pred_5 obj_15 obj_11)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_14 obj_17)
       (pred_7 obj_08)
    )

    (:goal (and
       (pred_5 obj_14 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_19)))
)
)

; plan
1. (op_4 obj_08 obj_10)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_10)
   goals met: 0 of 1
2. (op_4 obj_10 obj_11)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_11)
   goals met: 0 of 1
3. (op_2 obj_11 obj_15)
   deleted: (pred_5 obj_15 obj_11) (pred_10)
   added: (pred_2 obj_15)
   goals met: 0 of 1
4. (op_4 obj_11 obj_10)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_10)
   goals met: 0 of 1
5. (op_3 obj_10 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_10) (pred_5 obj_15 obj_10)
   goals met: 0 of 1
6. (op_4 obj_10 obj_08)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_08)
   goals met: 0 of 1
7. (op_4 obj_08 obj_20)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_20)
   goals met: 0 of 1
8. (op_2 obj_20 obj_04)
   deleted: (pred_5 obj_04 obj_20) (pred_10)
   added: (pred_2 obj_04)
   goals met: 0 of 1
9. (op_4 obj_20 obj_08)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_08)
   goals met: 0 of 1
10. (op_4 obj_08 obj_10)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_10)
   goals met: 0 of 1
11. (op_4 obj_10 obj_11)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_11)
   goals met: 0 of 1
12. (op_1 obj_11 obj_02 obj_04 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_11 obj_02)
   goals met: 0 of 1
13. (op_4 obj_11 obj_02)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_02)
   goals met: 0 of 1
14. (op_4 obj_02 obj_17)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_17)
   goals met: 0 of 1
15. (op_5 obj_17 obj_14 obj_04)
   deleted: (pred_2 obj_04) (pred_5 obj_14 obj_17)
   added: (pred_2 obj_14) (pred_5 obj_04 obj_17)
   goals met: 0 of 1
16. (op_4 obj_17 obj_02)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_02)
   goals met: 0 of 1
17. (op_4 obj_02 obj_11)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_11)
   goals met: 0 of 1
18. (op_4 obj_11 obj_10)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_10)
   goals met: 0 of 1
19. (op_5 obj_10 obj_15 obj_14)
   deleted: (pred_2 obj_14) (pred_5 obj_15 obj_10)
   added: (pred_2 obj_15) (pred_5 obj_14 obj_10)
   goals met: 1 of 1
